In [5]:
import numpy as np
import pandas as pd

data = pd.read_csv("../Datasets/Personal_Finance_Data_2024.csv")

In [6]:
data

,Date,Transaction Description,Category,Amount,Type
0,02-01-2024,Gas teacher national weight all.,Travel,1099.90,Expense
1,02-01-2024,Himself fire heavy.,Rent,101.10,Expense
2,04-01-2024,Allow news.,Investment,3852.00,Income
3,04-01-2024,Man care resource.,Investment,2036.00,Income
4,07-01-2024,Notice make.,Other,2266.00,Income
...,...,...,...,...,...
299,28-12-2024,Quite as when.,Rent,514.09,Expense
300,28-12-2024,Right analysis mention.,Entertainment,727.25,Expense
301,28-12-2024,No couple debate must.,Investment,1425.00,Income
302,29-12-2024,Discussion black follow.,Shopping,655.78,Expense
303,29-12-2024,Pressure activity defense detail.,Other,1480.00,Income

In [9]:
data.shape

(304, 5)

In [10]:
data.isnull().sum()

Date                       0
Transaction Description    0
Category                   0
Amount                     0
Type                       0
dtype: int64

In [15]:
data.columns

Index(['Date', 'Transaction Description', 'Category', 'Amount', 'Type'], dtype='object')

In [16]:
data.columns = data.columns.str.strip().str.lower().str.replace(' ', '_')

In [17]:
data

,date,transaction_description,category,amount,type
0,02-01-2024,Gas teacher national weight all.,Travel,1099.90,Expense
1,02-01-2024,Himself fire heavy.,Rent,101.10,Expense
2,04-01-2024,Allow news.,Investment,3852.00,Income
3,04-01-2024,Man care resource.,Investment,2036.00,Income
4,07-01-2024,Notice make.,Other,2266.00,Income
...,...,...,...,...,...
299,28-12-2024,Quite as when.,Rent,514.09,Expense
300,28-12-2024,Right analysis mention.,Entertainment,727.25,Expense
301,28-12-2024,No couple debate must.,Investment,1425.00,Income
302,29-12-2024,Discussion black follow.,Shopping,655.78,Expense
303,29-12-2024,Pressure activity defense detail.,Other,1480.00,Income

In [19]:
q_low = data['amount'].quantile(0.01)
q_high = data['amount'].quantile(0.99)
data = data[(data['amount'] >= q_low) & (data['amount'] <= q_high)]

In [20]:
data['amount']

0      1099.90
1       101.10
2      3852.00
3      2036.00
4      2266.00
        ...
299     514.09
300     727.25
301    1425.00
302     655.78
303    1480.00
Name: amount, Length: 296, dtype: float64

In [22]:
data['amount_normalized'] = (data['amount'] - data['amount'].min()) / (data['amount'].max() - data['amount'].min())

C:\Users\shyam\AppData\Local\Temp\ipykernel_4204\2875403800.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['amount_normalized'] = (data['amount'] - data['amount'].min()) / (data['amount'].max() - data['amount'].min())

In [23]:
data['amount']

0      1099.90
1       101.10
2      3852.00
3      2036.00
4      2266.00
        ...
299     514.09
300     727.25
301    1425.00
302     655.78
303    1480.00
Name: amount, Length: 296, dtype: float64

In [24]:
data['amount'].describe()

count     296.000000
mean     1367.387162
std       948.274297
min        59.160000
25%       726.202500
50%      1242.210000
75%      1732.420000
max      4780.000000
Name: amount, dtype: float64

In [25]:
data

,date,transaction_description,category,amount,type,amount_normalized
0,02-01-2024,Gas teacher national weight all.,Travel,1099.90,Expense,0.220457
1,02-01-2024,Himself fire heavy.,Rent,101.10,Expense,0.008884
2,04-01-2024,Allow news.,Investment,3852.00,Income,0.803425
3,04-01-2024,Man care resource.,Investment,2036.00,Income,0.418748
4,07-01-2024,Notice make.,Other,2266.00,Income,0.467468
...,...,...,...,...,...,...
299,28-12-2024,Quite as when.,Rent,514.09,Expense,0.096366
300,28-12-2024,Right analysis mention.,Entertainment,727.25,Expense,0.141519
301,28-12-2024,No couple debate must.,Investment,1425.00,Income,0.289321
302,29-12-2024,Discussion black follow.,Shopping,655.78,Expense,0.126380
303,29-12-2024,Pressure activity defense detail.,Other,1480.00,Income,0.300972

In [27]:
print(data.describe())

            amount  amount_normalized
count   296.000000         296.000000
mean   1367.387162           0.277117
std     948.274297           0.200870
min      59.160000           0.000000
25%     726.202500           0.141297
50%    1242.210000           0.250602
75%    1732.420000           0.354441
max    4780.000000           1.000000

In [29]:
data['date'] = pd.to_datetime(data['date'], errors='coerce')

C:\Users\shyam\AppData\Local\Temp\ipykernel_4204\693948497.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['date'] = pd.to_datetime(data['date'], errors='coerce')

In [30]:
data

,date,transaction_description,category,amount,type,amount_normalized
0,2024-02-01,Gas teacher national weight all.,Travel,1099.90,Expense,0.220457
1,2024-02-01,Himself fire heavy.,Rent,101.10,Expense,0.008884
2,2024-04-01,Allow news.,Investment,3852.00,Income,0.803425
3,2024-04-01,Man care resource.,Investment,2036.00,Income,0.418748
4,2024-07-01,Notice make.,Other,2266.00,Income,0.467468
...,...,...,...,...,...,...
299,NaT,Quite as when.,Rent,514.09,Expense,0.096366
300,NaT,Right analysis mention.,Entertainment,727.25,Expense,0.141519
301,NaT,No couple debate must.,Investment,1425.00,Income,0.289321
302,NaT,Discussion black follow.,Shopping,655.78,Expense,0.126380
303,NaT,Pressure activity defense detail.,Other,1480.00,Income,0.300972